# import pandas as pd
# import re
# # df = pd.read_csv("extracted_data/main_doc_chunks.csv")
# # print(df.head(30))
# text = """'ข้อ  2 . ระดับโทษทางวินัยและวินัยซึ่งพนักงานจะต้องรักษามีดังนี้  \n2 .1  ระดับโทษทางวินัยแบ่งเป็น 4 ระดับจากโทษเบาไปหาโทษหนักคือ  \n   2 .1.1  ตักเตือนด้วยวาจา  \n 2 .1.2  ตักเตือนเป็นหนังสือ  \n 2 .1.3  ตัดเงินรางวัลพิเศษประจาปี  \n 2 .1.4  เลิกจ้าง  \n2.2 วินัยซึ่งพนักงานจะต้องรักษาและระดับโทษสาหรับพนักงานที่ฝ่าฝืนวินัย  \nวินัยระดับโทษ  \n2 .2.1   ต้องปฏิบัติตามข้อบังคับระเบียบคาสั่งและประกาศของบริษัทฯตั้งแต่ตักเตือนด้วยวาจาจนถึงเลิกจ้าง  \n2 .2.2   ต้องเชื่อฟังและปฏิบัติตามคาสั่งโดยชอบของผู้บังคับบัญชาตั้งแต่ตักเตือนเป็นหนังสือจนถึงตัด\nเงินรางวัลพิเศษประจาปี  \n2 .2.3   ต้องปฏิบัติงานด้วยความซื่อสัตย์สุจริตอุตสาหะและตรงต่อเวลาตั้งแต่ตักเตือนด้วยวาจาจนถึงเลิกจ้าง  \n2 .2.4   ต้องควบคุมดูแลพนักงานใต้บังคับบัญชาให้ปฏิบัติตามวินัยโดยตั้งแต่ตักเตือนเป็นหนังสือจนถึงตัด-15- \n \n วินัยระดับโทษ  \n          เคร่งครัดถ้ารู้ว่าพนักงานผู้ใดกระทาความผิดแล้วไม่รายงานให้  \n          ผู้บังคับบัญชาเหนือชั้นขึ้นไปทราบถือว่าผู้บังคับบัญชานั้นกระทา    \n          ผิดวินัยด้วยเงินรางวัลพิเศษประจาปี  \n2 .2.5   ต้องแต่งเครื่องแบบตามที่บริษัทฯกาหนดให้และติดบัตร  \n          ประจาตัวของพนักงานตลอดเวลาที่อยู่ในบริษัทฯตั้งแต่ตักเตือนด้วยวาจาจนถึงตัดเงิน\nรางวัลพิเศษประจาปี   \n2 .2.6   ต้องใช้และรักษาทรัพย์สินของบริษัทฯด้วยความระมัดระวัง  \n          ไม่ให้เสียหายหรือสูญหายและจะนาทรัพย์สินของบริษัทฯ  \n          ออกไปนอกสถานที่ของบริษัทฯไม่ได้เว้นแต่จะได้รับอนุมัติจาก    \n          กรรมการผู้จัดการใหญ่หรือผู้ซึ่งได้รับมอบหมายตั้งแต่ตักเตือนด้วยวาจาจนถึงตัดเงิน\nรางวัลพิเศษประจาปี  \n2 .2.7   ต้องส่งคืนทรัพย์สินของบริษัทฯให้แก่บริษัทฯผ่านผู้บังคับบัญชา  \n          ก่อนการสิ้นสุดการจ้างตั้งแต่ตักเตือนด้วยวาจาจนถึงตัดเงิน\nรางวัลพิเศษประจาปี  \n2 .2.8   ต้องรักษาความลับของบริษัทฯโดยเคร่งครัดไม่แม้แต่ปรึกษา\nปัญหาภายในบริษัทฯกับบุคคลในครอบครัวตั้งแต่ตักเตือนเป็นหนังสือจนถึง  \nเลิกจ้างและบันทึกชื่อในบัญชีดา \n \nวินัยระดับโทษ  \n2 .2.9   ต้องไม่ใช้อานาจหน้าที่ในทางทุจริตเพื่อแสวงหาประโยชน์โดย  \n          มิชอบเพื่อตนเองหรือผู้อื่นตั้งแต่ตักเตือนเป็นหนังสือจนถึง  \nเลิกจ้าง  \n2 .2.1 0   ต้องไม่ปฏิบัติงานข้ามขั้นผู้บังคับบัญชาเหนือตนเว้นแต่กรณี  \n            เร่งด่วนโดยได้รับคาสั่งจากผู้บังคับบัญชาชั้นสูงกว่าและให้    \n            รายงานผู้บังคับบัญชาเหนือตนทราบโดยเร็วตั้งแต่ตักเตือนด้วยวาจาจนถึงตัดเงิน\nรางวัลพิเศษประจาปี  \n2 .2.1 1   ต้องไม่ปฏิบัติงานก้าวก่ายการทางานของผู้อื่นจนเป็นเหตุให้เกิด  \n            ความเสียหายต่อบริษัทฯหรือพนักงานด้วยกันหรือ  \n            บุคคลภายนอกตั้งแต่ตักเตือนด้วยวาจาจนถึงตัดเงิน\nรางวัลพิเศษประจาปี  \n2 .2.1 2   ต้องไม่รายงานเท็จต่อผู้บังคับบัญชาตั้งแต่ตักเตือนเป็นหนังสือจนถึงตัด\nเงินรางวัลพิเศษประจาปี   \n2 .2.1 3   ต้องไม่ขาดงานหรือละทิ้งหน้าที่โดยไม่มีเหตุผลอันสมควรตั้งแต่ตักเตือนด้วยวาจาจนถึงเลิกจ้าง  \n2 .2.1 4   ต้องไม่บันทึกเวลามาทางานและเวลากลับแทนกันตั้งแต่ตักเตือนเป็นหนังสือจนถึง -16- \n \n วินัยระดับโทษ  \nเลิกจ้าง  \n2 .2.1 5   ต้องไม่ก่อการวิวาทหรือแสดงกิริยาวาจาไม่สุภาพตั้งแต่ตักเตือนด้วยวาจาจนถึงตัดเงิน\nรางวัลพิเศษประจาปี   \n2 .2.1 6   ต้องไม่ยุยงส่งเสริมบ่อนทาลายหรือปลุกระดมมวลชนอันเป็น   \n            การผิดกฎหมายและก่อให้เกิความเสียหายต่อบริษัทฯตั้งแต่ตักเตือนเป็นหนังสือจนถึง  \nเลิกจ้าง  \n2 .2.1 7   ต้องไม่พกพาอาวุธหรือสิ่งผิดกฎหมายเข้ามาในบริษัทฯตั้งแต่ตักเตือนเป็นหนังสือจนถึง  \nเลิกจ้าง  \n2 .2.1 8   ต้องไม่เล่นการพนันหรือชักชวนบุคคลภายนอกมาเล่นการพนัน  \n            ในสถานที่ของบริษัทฯตั้งแต่ตักเตือนด้วยวาจาจนถึงเลิกจ้าง  \n2 .2.1 9   ต้องไม่ดื่มสุราหรือเสพของมึนเมาหรืออยู่ในอาการมึนเมาใน  \n            สถานที่ปฏิบัติงานเว้นแต่เพื่อการรับรองหรืองานรื่นเริงของ   \n            บริษัทฯตั้งแต่ตักเตือนด้วยวาจาจนถึงตัดเงิน\nรางวัลพิเศษประจาปี   \n \nกรณีพนักงานฝ่าฝืนวินัยตั้งแต่สามข้อขึ้นไปการลงโทษทางวินัยจะถูกพิจารณาลงโทษในข้อที่มีระดับโทษ\nหนักที่สุด'"""
# # Regex pattern to match each disciplinary action and its corresponding authority
# # Regex pattern to match and format the desired sections
# line = "*"*25
# print(line)
# print(text)
# print(line)
# # pattern = r'(\d \.\d\.\d+)\s*(.*?)ตั้งแต่(.*?)จนถึง(.*?)(?=\d \.\d\.\d|$)'
# # updated_pattern = r'(\d \.\d\.\d+)\s*(.*?)ตั้งแต่(.*?)จนถึง(.*?)(?=\d \.\d\.\d+|$)'
# # revised_pattern = r'(\d \.\d\.\d{1,2})\s*(.*?)ตั้งแต่(.*?)จนถึง(.*?)(?=\d \.\d\.\d{1,2}|$)'
# revised_pattern_with_space = r'(\d \.\d\.\d{1,2} ?\d{0,2})\s*(.*?)ตั้งแต่(.*?)จนถึง(.*?)(?=\d \.\d\.\d{1,2} ?\d{0,2}|$)'
# # revised_pattern_specific = r'(\d \.\d\.\d{1,2} ?\d{0,2})\s*(.*?)(ตั้งแต่.*?จนถึง.*?)(?=\d \.\d\.\d{1,2} ?\d{0,2}|$)'
# # revised_pattern_final = r'(\d \.\d\.\d{1,2} ?\d{0,2})\s*(.*?)ตั้งแต่(.*?)จนถึง(.*?)(?=\d \.\d\.\d{1,2} ?\d{0,2}|$)'
# # revised_pattern_for_2_2_4 = r'(\d \.\d\.\d{1,2} ?\d{0,2})\s*(.*?)(ตั้งแต่.*?จนถึง.*?)(?=\d \.\d\.\d{1,2} ?\d{0,2}|$)'

# # Custom function for specific formatting

# # Replacement format
# replacement = r'\1\nวินัย: \2\nระดับโทษ: ตั้งแต่\3จนถึง\4\n'

# # Performing the substitution
# output_text = re.sub(revised_pattern_with_space, replacement, text, flags=re.DOTALL)
# # revised_output_text_for_2_2_4 = re.sub(revised_pattern_for_2_2_4, custom_format_for_2_2_4, text, flags=re.DOTALL)

# print(line)
# print(output_text)
# print(line)

from PIL import Image
import pytesseract

img_path = 'assets/img/imgtest.png'
Image.open(img_path)